zekeng/msp432r-core/variants/MSP_EXP432P401R/Board_init.c
const UART_Config UART_config[] = {
    {
        .fxnTablePtr = &myUARTMSP432_fxnTable,
        .object = &uartMSP432Objects[Board_UARTA0],
        .hwAttrs = &uartMSP432HWAttrs[Board_UARTA0]
    },

    {
        .fxnTablePtr = &myUARTMSP432_fxnTable,
        .object = &uartMSP432Objects[Board_UARTA2],
        .hwAttrs = &uartMSP432HWAttrs[Board_UARTA2]
    },

#ifdef ENERGIA_BOARD_SERIAL2_ENABLE
    {
        .fxnTablePtr = &myUARTMSP432_fxnTable,
        .object = &uartMSP432Objects[Board_UARTA1],
        .hwAttrs = &uartMSP432HWAttrs[Board_UARTA1]
    },
#endif

#ifdef ENERGIA_BOARD_SERIAL3_ENABLE
    {
        .fxnTablePtr = &myUARTMSP432_fxnTable,
        .object = &uartMSP432Objects[Board_UARTA3],
        .hwAttrs = &uartMSP432HWAttrs[Board_UARTA3]
    },
#endif
};

const uint_least8_t UART_count = Board_UARTCOUNT;

/*
 *  =============================== Watchdog ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */

#include <ti/drivers/Watchdog.h>
#include <ti/drivers/watchdog/WatchdogMSP432.h>

/* Watchdog objects */
WatchdogMSP432_Object watchdogMSP432Objects[Board_WATCHDOGCOUNT];

/* Watchdog configuration structure */
const WatchdogMSP432_HWAttrs watchdogMSP432HWAttrs[Board_WATCHDOGCOUNT] = {
    {
        .baseAddr = WDT_A_BASE,
        .intNum = INT_WDT_A,
        .intPriority = (~0),
        .clockSource = WDT_A_CLOCKSOURCE_SMCLK,
        .clockDivider = WDT_A_CLOCKDIVIDER_8192K
    },
};

const Watchdog_Config Watchdog_config[] = {
    {
        .fxnTablePtr = &WatchdogMSP432_fxnTable,
        .object = &watchdogMSP432Objects[0],
        .hwAttrs = &watchdogMSP432HWAttrs[0]
    },
};

const uint_least8_t Watchdog_count = Board_WATCHDOGCOUNT;

/*
 *  ======== Board_initWatchdog ========
 */
void Board_initWatchdog(void)
{
    /* Initialize the Watchdog driver */
    Watchdog_init();
}

/*
 *  ======== Board_init ========
 */
void Board_init(void) {
    Board_initGPIO();
    Board_initPWM();
    Board_initPower();
}

